export const testData1 = [
  { type: "衣物衣物衣物衣物衣物销量", clothing: "衬衫", sales: 5 },
  { type: "衣物衣物衣物衣物衣物销量", clothing: "羊毛衫", sales: 20 },
  { type: "衣物衣物衣物衣物衣物销量", clothing: "雪纺衫", sales: "36" },
  { type: "衣物衣物衣物衣物衣物销量", clothing: "裤子", sales: 10 },
  { type: "衣物衣物衣物衣物衣物销量", clothing: "高跟鞋", sales: 10 },
  { type: "衣物衣物衣物衣物衣物销量", clothing: "袜子", sales: 56 },
  { type: "衣物衣物衣物衣物衣物库存", clothing: "衬衫", sales: 2 },
  { type: "衣物衣物衣物衣物衣物库存", clothing: "羊毛衫", sales: 9 },
  { type: "衣物衣物衣物衣物衣物库存", clothing: "雪纺衫", sales: 17 },
  { type: "衣物衣物衣物衣物衣物库存", clothing: "裤子", sales: 3 },
  { type: "衣物衣物衣物衣物衣物库存", clothing: "高跟鞋", sales: 28 },
  { type: "衣物衣物衣物衣物衣物库存", clothing: "袜子", sales: 12 },
  { type: "衣物衣物衣物衣物衣物破损", clothing: "衬衫", sales: 5 },
  { type: "衣物衣物衣物衣物衣物破损", clothing: "羊毛衫", sales: 23 },
  { type: "衣物衣物衣物衣物衣物破损", clothing: "雪纺衫", sales: 8 },
  { type: "衣物衣物衣物衣物衣物破损", clothing: "裤子", sales: 11 },
  { type: "衣物衣物衣物衣物衣物破损", clothing: "高跟鞋", sales: 7 },
  { type: "衣物衣物衣物衣物衣物破损", clothing: "袜子", sales: 32 },
  // { type: "衣物衣物衣物衣物衣物回退", clothing: "衬衫", sales: 39 },
  // { type: "衣物衣物衣物衣物衣物回退", clothing: "羊毛衫", sales: 12 },
  // { type: "衣物衣物衣物衣物衣物回退", clothing: "雪纺衫", sales: 4 },
  // { type: "衣物衣物衣物衣物衣物回退", clothing: "裤子", sales: 27 },
  // { type: "衣物衣物衣物衣物衣物回退", clothing: "高跟鞋", sales: 19 },
  // { type: "衣物衣物衣物衣物衣物回退", clothing: "袜子", sales: 42 },
  // { type: "衣物衣物衣物衣物衣物换码", clothing: "衬衫", sales: 60 },
  // { type: "衣物衣物衣物衣物衣物换码", clothing: "羊毛衫", sales: 41 },
  // { type: "衣物衣物衣物衣物衣物换码", clothing: "雪纺衫", sales: 18 },
  // { type: "衣物衣物衣物衣物衣物换码", clothing: "裤子", sales: 27 },
  // { type: "衣物衣物衣物衣物衣物换码", clothing: "高跟鞋", sales: 5 },
  // { type: "衣物衣物衣物衣物衣物换码", clothing: "袜子", sales: 23 },
  // { type: "衣物衣物衣物衣物衣物仓储", clothing: "衬衫", sales: 23 },
  // { type: "衣物衣物衣物衣物衣物仓储", clothing: "羊毛衫", sales: 17 },
  // { type: "衣物衣物衣物衣物衣物仓储", clothing: "雪纺衫", sales: 9 },
  // { type: "衣物衣物衣物衣物衣物仓储", clothing: "裤子", sales: 31 },
  // { type: "衣物衣物衣物衣物衣物仓储", clothing: "高跟鞋", sales: 25 },
  // { type: "衣物衣物衣物衣物衣物仓储", clothing: "袜子", sales: 13 },
  // { type: "衣物销量", clothing: "袜子1", sales: 22 },
  // { type: "衣物销量", clothing: "袜子2", sales: 22 },
  // { type: "衣物销量", clothing: "袜子3", sales: 22 },
  // { type: "衣物销量", clothing: "袜子4", sales: 22 },
  // { type: "衣物销量", clothing: "袜子5", sales: 22 },
  // { type: "衣物销量", clothing: "袜子6", sales: 22 },
  // { type: "衣物销量", clothing: "袜子7", sales: 22 },
  // { type: "衣物销量", clothing: "袜子8", sales: 22 },
  // { type: "衣物销量", clothing: "袜子9", sales: 22 },
  // { type: "衣物销量", clothing: "袜子10", sales: 22 },
  // { type: "衣物销量", clothing: "袜子11", sales: 22 },
  // { type: "衣物销量", clothing: "袜子12", sales: 22 },
  // { type: "衣物销量", clothing: "袜子13", sales: 22 },
  // { type: "衣物销量", clothing: "袜子14", sales: 22 },
  // { type: "衣物销量", clothing: "袜子15", sales: 22 },
  // { type: "衣物销量", clothing: "袜子16", sales: 22 },
  // { type: "衣物销量", clothing: "袜子17", sales: 22 },
  // { type: "衣物销量", clothing: "袜子18", sales: 22 },
  // { type: "衣物销量", clothing: "袜子19", sales: 28 },
  // { type: "衣物销量", clothing: "袜子20", sales: 22 },
  // { type: "衣物销量", clothing: "袜子21", sales: 22 },
  // { type: "衣物销量", clothing: "袜子22", sales: 22 },
  // { type: "衣物销量", clothing: "袜子23", sales: 22 },
  // { type: "衣物销量", clothing: "袜子24", sales: 22 },
  // { type: "衣物销量", clothing: "袜子25", sales: 22 },
  // { type: "衣物销量", clothing: "袜子26", sales: 22 },
  // { type: "衣物销量", clothing: "袜子27", sales: 22 },
  // { type: "衣物销量", clothing: "袜子28", sales: 22 },
  // { type: "衣物销量", clothing: "袜子29", sales: 22 },
  // { type: "衣物销量", clothing: "袜子30", sales: 22 },
  // { type: "衣物销量", clothing: "袜子31", sales: 22 },
  // { type: "衣物销量", clothing: "袜子32", sales: 22 },
  // { type: "衣物销量", clothing: "袜子33", sales: 22 },
  // { type: "衣物销量", clothing: "袜子34", sales: 22 },
  // { type: "衣物销量", clothing: "袜子35", sales: 22 },
  // { type: "衣物销量", clothing: "袜子36", sales: 22 },
  // { type: "衣物销量", clothing: "袜子37", sales: 22 },
  // { type: "衣物销量", clothing: "袜子38", sales: 22 },
  // { type: "衣物销量", clothing: "袜子39", sales: 22 },
  // { type: "衣物销量", clothing: "袜子40", sales: 22 },
  // { type: "衣物销量", clothing: "袜子41", sales: 22 },
  // { type: "衣物销量", clothing: "袜子42", sales: 22 },
  // { type: "衣物销量", clothing: "袜子43", sales: 22 },
  // { type: "衣物销量", clothing: "袜子44", sales: 22 },
  // { type: "衣物销量", clothing: "袜子45", sales: 22 },
  // { type: "衣物销量", clothing: "袜子46", sales: 22 },
  // { type: "衣物销量", clothing: "袜子47", sales: 22 },
  // { type: "衣物销量", clothing: "袜子48", sales: 22 },
  // { type: "衣物销量", clothing: "袜子49", sales: 22 },
  // { type: "衣物销量", clothing: "袜子50", sales: 22 },
  // { type: "衣物销量", clothing: "袜子51", sales: 22 },
  // { type: "衣物销量", clothing: "袜子52", sales: 22 },
  // { type: "衣物销量", clothing: "袜子53", sales: 22 },
  // { type: "衣物销量", clothing: "袜子54", sales: 22 },
  // { type: "衣物销量", clothing: "袜子55", sales: 22 },
  // { type: "衣物销量", clothing: "袜子56", sales: 22 },
  // { type: "衣物销量", clothing: "袜子57", sales: 22 },
  // { type: "衣物销量", clothing: "袜子58", sales: 22 },
  // { type: "衣物销量", clothing: "袜子59", sales: 22 },
  // { type: "衣物销量", clothing: "袜子60", sales: 22 },
  // { type: "衣物销量", clothing: "袜子61", sales: 22 },
  // { type: "衣物销量", clothing: "袜子62", sales: 22 },
  // { type: "衣物销量", clothing: "袜子63", sales: 22 },
  // { type: "衣物销量", clothing: "袜子64", sales: 22 },
  // { type: "衣物销量", clothing: "袜子65", sales: 22 },
  // { type: "衣物销量", clothing: "袜子66", sales: 22 },
  // { type: "衣物销量", clothing: "袜子67", sales: 22 },
  // { type: "衣物销量", clothing: "袜子68", sales: 22 },
  // { type: "衣物销量", clothing: "袜子69", sales: 22 },
  // { type: "衣物销量", clothing: "袜子70", sales: 22 },
  // { type: "衣物销量", clothing: "袜子71", sales: 22 },
  // { type: "衣物销量", clothing: "袜子72", sales: 22 },
  // { type: "衣物销量", clothing: "袜子73", sales: 22 },
  // { type: "衣物销量", clothing: "袜子74", sales: 22 },
  // { type: "衣物销量", clothing: "袜子75", sales: 22 },
  // { type: "衣物销量", clothing: "袜子76", sales: 22 },
  // { type: "衣物销量", clothing: "袜子77", sales: 22 },
  // { type: "衣物销量", clothing: "袜子78", sales: 22 },
  // { type: "衣物销量", clothing: "袜子79", sales: 22 },
  // { type: "衣物销量", clothing: "袜子80", sales: 22 },
  // { type: "衣物销量", clothing: "袜子81", sales: 22 },
  // { type: "衣物销量", clothing: "袜子82", sales: 22 },
  // { type: "衣物销量", clothing: "袜子83", sales: 22 },
  // { type: "衣物销量", clothing: "袜子84", sales: 22 },
  // { type: "衣物销量", clothing: "袜子85", sales: 22 },
  // { type: "衣物销量", clothing: "袜子86", sales: 22 },
  // { type: "衣物销量", clothing: "袜子87", sales: 22 },
  // { type: "衣物销量", clothing: "袜子88", sales: 22 },
  // { type: "衣物销量", clothing: "袜子89", sales: 22 },
  // { type: "衣物销量", clothing: "袜子90", sales: 22 },
  // { type: "衣物销量", clothing: "袜子91", sales: 22 },
  // { type: "衣物销量", clothing: "袜子92", sales: 22 },
  // { type: "衣物销量", clothing: "袜子93", sales: 22 },
  // { type: "衣物销量", clothing: "袜子94", sales: 22 },
  // { type: "衣物销量", clothing: "袜子95", sales: 22 },
  // { type: "衣物销量", clothing: "袜子96", sales: 22 },
  // { type: "衣物销量", clothing: "袜子97", sales: 22 },
  // { type: "衣物销量", clothing: "袜子98", sales: 22 },
  // { type: "衣物销量", clothing: "袜子99", sales: 22 },
  // { type: "衣物销量", clothing: "袜子100", sales: 27 },
];

export const testData2 = [
  {
    type: "bar",
    name: "衣物衣物衣物衣物衣物销量",
    data: [
      { name: "衬衫", value: 5 },
      { name: "羊毛衫", value: 20 },
      { name: "雪纺衫", value: 36 },
      { name: "裤子", value: 10 },
      { name: "高跟鞋", value: 10 },
      { name: "袜子", value: 56 },
    ],
  },
  {
    type: "bar",
    name: "衣物衣物衣物衣物衣物库存",
    data: [
      { name: "衬衫", value: 2 },
      { name: "羊毛衫", value: 9 },
      { name: "雪纺衫", value: 17 },
      { name: "裤子", value: 3 },
      { name: "高跟鞋", value: 28 },
      { name: "袜子", value: 12 },
    ],
  },
  {
    type: "bar",
    name: "衣物衣物衣物衣物衣物破损",
    data: [
      { name: "衬衫", value: 5 },
      { name: "羊毛衫", value: 23 },
      { name: "雪纺衫", value: 8 },
      { name: "裤子", value: 11 },
      { name: "高跟鞋", value: 7 },
      { name: "袜子", value: 32 },
    ],
  },
];

export const testCategoryData = ["2022-07-01", "2022-07-02", "2022-07-03", "2022-07-04", "2022-07-05", "2022-07-06", "2022-07-07", "2022-07-08", "2022-07-09", "2022-07-10", "2022-07-11", "2022-07-12", "2022-07-13", "2022-07-14", "2022-07-15", "2022-07-16", "2022-07-17", "2022-07-18", "2022-07-19", "2022-07-20", "2022-07-21", "2022-07-22", "2022-07-23", "2022-07-24", "2022-07-25", "2022-07-26", "2022-07-27", "2022-07-28", "2022-07-29", "2022-07-30", "2022-07-31", "2022-08-01", "2022-08-02", "2022-08-03", "2022-08-04", "2022-08-05", "2022-08-06", "2022-08-07", "2022-08-08", "2022-08-09", "2022-08-10", "2022-08-11", "2022-08-12", "2022-08-13", "2022-08-14", "2022-08-15", "2022-08-16", "2022-08-17", "2022-08-18", "2022-08-19", "2022-08-20", "2022-08-21", "2022-08-22", "2022-08-23", "2022-08-24", "2022-08-25", "2022-08-26", "2022-08-27", "2022-08-28", "2022-08-29", "2022-08-30", "2022-08-31"];

export const testData3 = [
  {
    "name": "本次",
    "data": [
      {"value": null, "name": "2022-07-01(星期五)"}, {
        "value": null,
        "name": "2022-07-02(星期六)",
      }, {"value": null, "name": "2022-07-03(星期日)"}, {"value": null, "name": "2022-07-04(星期一)"}, {
        "value": null,
        "name": "2022-07-05(星期二)",
      }, {"value": null, "name": "2022-07-06(星期三)"}, {"value": null, "name": "2022-07-07(星期四)"}, {
        "value": null,
        "name": "2022-07-08(星期五)",
      }, {"value": null, "name": "2022-07-09(星期六)"}, {"value": null, "name": "2022-07-10(星期日)"}, {
        "value": null,
        "name": "2022-07-11(星期一)",
      }, {"value": null, "name": "2022-07-12(星期二)"}, {"value": null, "name": "2022-07-13(星期三)"}, {
        "value": null,
        "name": "2022-07-14(星期四)",
      }, {"value": null, "name": "2022-07-15(星期五)"}, {"value": null, "name": "2022-07-16(星期六)"}, {
        "value": null,
        "name": "2022-07-17(星期日)",
      }, {"value": null, "name": "2022-07-18(星期一)"}, {"value": null, "name": "2022-07-19(星期二)"}, {
        "value": null,
        "name": "2022-07-20(星期三)",
      }, {"value": null, "name": "2022-07-21(星期四)"}, {"value": null, "name": "2022-07-22(星期五)"}, {
        "value": null,
        "name": "2022-07-23(星期六)",
      }, {"value": null, "name": "2022-07-24(星期日)"}, {"value": null, "name": "2022-07-25(星期一)"}, {
        "value": null,
        "name": "2022-07-26(星期二)",
      }, {"value": null, "name": "2022-07-27(星期三)"}, {"value": null, "name": "2022-07-28(星期四)"}, {
        "value": null,
        "name": "2022-07-29(星期五)",
      }, {"value": null, "name": "2022-07-30(星期六)"}, {"value": null, "name": "2022-07-31(星期日)"}, {
        "value": null,
        "name": "2022-08-01(星期一)",
      }, {"value": null, "name": "2022-08-02(星期二)"}, {"value": null, "name": "2022-08-03(星期三)"}, {
        "value": null,
        "name": "2022-08-04(星期四)",
      }, {"value": null, "name": "2022-08-05(星期五)"}, {"value": null, "name": "2022-08-06(星期六)"}, {
        "value": null,
        "name": "2022-08-07(星期日)",
      }, {"value": null, "name": "2022-08-08(星期一)"}, {"value": null, "name": "2022-08-09(星期二)"}, {
        "value": null,
        "name": "2022-08-10(星期三)",
      }, {"value": null, "name": "2022-08-11(星期四)"}, {"value": null, "name": "2022-08-12(星期五)"}, {
        "value": null,
        "name": "2022-08-13(星期六)",
      }, {"value": null, "name": "2022-08-14(星期日)"}, {"value": null, "name": "2022-08-15(星期一)"}, {
        "value": null,
        "name": "2022-08-16(星期二)",
      }, {"value": null, "name": "2022-08-17(星期三)"}, {"value": null, "name": "2022-08-18(星期四)"}, {
        "value": null,
        "name": "2022-08-19(星期五)",
      }, {"value": null, "name": "2022-08-20(星期六)"}, {"value": null, "name": "2022-08-21(星期日)"}, {
        "value": null,
        "name": "2022-08-22(星期一)",
      }, {"value": null, "name": "2022-08-23(星期二)"}, {"value": null, "name": "2022-08-24(星期三)"}, {
        "value": null,
        "name": "2022-08-25(星期四)",
      }, {"value": null, "name": "2022-08-26(星期五)"}, {"value": null, "name": "2022-08-27(星期六)"}, {
        "value": null,
        "name": "2022-08-28(星期日)",
      }, {"value": null, "name": "2022-08-29(星期一)"}, {"value": null, "name": "2022-08-30(星期二)"}, {
        "value": null,
        "name": "2022-08-31(星期三)",
      }],
  },
  {
    "name": "市场",
    "data": [{"value": null, "name": "2022-07-01(星期五)"}, {
      "value": null,
      "name": "2022-07-02(星期六)",
    }, {"value": null, "name": "2022-07-03(星期日)"}, {"value": null, "name": "2022-07-04(星期一)"}, {
      "value": null,
      "name": "2022-07-05(星期二)",
    }, {"value": null, "name": "2022-07-06(星期三)"}, {"value": null, "name": "2022-07-07(星期四)"}, {
      "value": null,
      "name": "2022-07-08(星期五)",
    }, {"value": null, "name": "2022-07-09(星期六)"}, {"value": null, "name": "2022-07-10(星期日)"}, {
      "value": null,
      "name": "2022-07-11(星期一)",
    }, {"value": null, "name": "2022-07-12(星期二)"}, {"value": null, "name": "2022-07-13(星期三)"}, {
      "value": null,
      "name": "2022-07-14(星期四)",
    }, {"value": null, "name": "2022-07-15(星期五)"}, {"value": null, "name": "2022-07-16(星期六)"}, {
      "value": null,
      "name": "2022-07-17(星期日)",
    }, {"value": null, "name": "2022-07-18(星期一)"}, {"value": null, "name": "2022-07-19(星期二)"}, {
      "value": null,
      "name": "2022-07-20(星期三)",
    }, {"value": null, "name": "2022-07-21(星期四)"}, {"value": null, "name": "2022-07-22(星期五)"}, {
      "value": null,
      "name": "2022-07-23(星期六)",
    }, {"value": null, "name": "2022-07-24(星期日)"}, {"value": null, "name": "2022-07-25(星期一)"}, {
      "value": null,
      "name": "2022-07-26(星期二)",
    }, {"value": null, "name": "2022-07-27(星期三)"}, {"value": null, "name": "2022-07-28(星期四)"}, {
      "value": null,
      "name": "2022-07-29(星期五)",
    }, {"value": null, "name": "2022-07-30(星期六)"}, {"value": null, "name": "2022-07-31(星期日)"}, {
      "value": "11440",
      "name": "2022-08-01(星期一)",
    }, {"value": "11440", "name": "2022-08-02(星期二)"}, {
      "value": "11440",
      "name": "2022-08-03(星期三)",
    }, {"value": "11330", "name": "2022-08-04(星期四)"}, {
      "value": "2791682",
      "name": "2022-08-05(星期五)",
    }, {"value": "2791682", "name": "2022-08-06(星期六)"}, {
      "value": "11440",
      "name": "2022-08-07(星期日)",
    }, {"value": "11440", "name": "2022-08-08(星期一)"}, {
      "value": "11440",
      "name": "2022-08-09(星期二)",
    }, {"value": "11440", "name": "2022-08-10(星期三)"}, {
      "value": "11440",
      "name": "2022-08-11(星期四)",
    }, {"value": "11440", "name": "2022-08-12(星期五)"}, {
      "value": "11440",
      "name": "2022-08-13(星期六)",
    }, {"value": "38927387", "name": "2022-08-14(星期日)"}, {
      "value": "38927387",
      "name": "2022-08-15(星期一)",
    }, {"value": "38927387", "name": "2022-08-16(星期二)"}, {
      "value": "38927387",
      "name": "2022-08-17(星期三)",
    }, {"value": "14988767", "name": "2022-08-18(星期四)"}, {
      "value": "12086641",
      "name": "2022-08-19(星期五)",
    }, {"value": "11340001", "name": "2022-08-20(星期六)"}, {
      "value": "14376279",
      "name": "2022-08-21(星期日)",
    }, {"value": "16077249", "name": "2022-08-22(星期一)"}, {
      "value": "14041884",
      "name": "2022-08-23(星期二)",
    }, {"value": "13815649", "name": "2022-08-24(星期三)"}, {
      "value": "17434283",
      "name": "2022-08-25(星期四)",
    }, {"value": "17660518", "name": "2022-08-26(星期五)"}, {
      "value": "13288018",
      "name": "2022-08-27(星期六)",
    }, {"value": "19017178", "name": "2022-08-28(星期日)"}, {
      "value": "17059220",
      "name": "2022-08-29(星期一)",
    }, {"value": "14830153", "name": "2022-08-30(星期二)"}, {"value": "16346113", "name": "2022-08-31(星期三)"}],
  },
  {
    "name": "加车",
    "data": [{"value": null, "name": "2022-07-01(星期五)"}, {
      "value": null,
      "name": "2022-07-02(星期六)",
    }, {"value": null, "name": "2022-07-03(星期日)"}, {"value": null, "name": "2022-07-04(星期一)"}, {
      "value": null,
      "name": "2022-07-05(星期二)",
    }, {"value": null, "name": "2022-07-06(星期三)"}, {"value": null, "name": "2022-07-07(星期四)"}, {
      "value": null,
      "name": "2022-07-08(星期五)",
    }, {"value": null, "name": "2022-07-09(星期六)"}, {"value": null, "name": "2022-07-10(星期日)"}, {
      "value": null,
      "name": "2022-07-11(星期一)",
    }, {"value": null, "name": "2022-07-12(星期二)"}, {"value": null, "name": "2022-07-13(星期三)"}, {
      "value": null,
      "name": "2022-07-14(星期四)",
    }, {"value": null, "name": "2022-07-15(星期五)"}, {"value": null, "name": "2022-07-16(星期六)"}, {
      "value": null,
      "name": "2022-07-17(星期日)",
    }, {"value": null, "name": "2022-07-18(星期一)"}, {"value": null, "name": "2022-07-19(星期二)"}, {
      "value": null,
      "name": "2022-07-20(星期三)",
    }, {"value": null, "name": "2022-07-21(星期四)"}, {"value": null, "name": "2022-07-22(星期五)"}, {
      "value": null,
      "name": "2022-07-23(星期六)",
    }, {"value": null, "name": "2022-07-24(星期日)"}, {"value": null, "name": "2022-07-25(星期一)"}, {
      "value": null,
      "name": "2022-07-26(星期二)",
    }, {"value": null, "name": "2022-07-27(星期三)"}, {"value": null, "name": "2022-07-28(星期四)"}, {
      "value": null,
      "name": "2022-07-29(星期五)",
    }, {"value": null, "name": "2022-07-30(星期六)"}, {"value": null, "name": "2022-07-31(星期日)"}, {
      "value": null,
      "name": "2022-08-01(星期一)",
    }, {"value": null, "name": "2022-08-02(星期二)"}, {"value": null, "name": "2022-08-03(星期三)"}, {
      "value": null,
      "name": "2022-08-04(星期四)",
    }, {"value": null, "name": "2022-08-05(星期五)"}, {"value": null, "name": "2022-08-06(星期六)"}, {
      "value": null,
      "name": "2022-08-07(星期日)",
    }, {"value": null, "name": "2022-08-08(星期一)"}, {"value": null, "name": "2022-08-09(星期二)"}, {
      "value": null,
      "name": "2022-08-10(星期三)",
    }, {"value": null, "name": "2022-08-11(星期四)"}, {"value": null, "name": "2022-08-12(星期五)"}, {
      "value": null,
      "name": "2022-08-13(星期六)",
    }, {"value": null, "name": "2022-08-14(星期日)"}, {"value": null, "name": "2022-08-15(星期一)"}, {
      "value": null,
      "name": "2022-08-16(星期二)",
    }, {"value": null, "name": "2022-08-17(星期三)"}, {"value": null, "name": "2022-08-18(星期四)"}, {
      "value": null,
      "name": "2022-08-19(星期五)",
    }, {"value": null, "name": "2022-08-20(星期六)"}, {"value": null, "name": "2022-08-21(星期日)"}, {
      "value": null,
      "name": "2022-08-22(星期一)",
    }, {"value": null, "name": "2022-08-23(星期二)"}, {"value": null, "name": "2022-08-24(星期三)"}, {
      "value": null,
      "name": "2022-08-25(星期四)",
    }, {"value": null, "name": "2022-08-26(星期五)"}, {"value": null, "name": "2022-08-27(星期六)"}, {
      "value": null,
      "name": "2022-08-28(星期日)",
    }, {"value": null, "name": "2022-08-29(星期一)"}, {"value": null, "name": "2022-08-30(星期二)"}, {
      "value": null,
      "name": "2022-08-31(星期三)",
    }],
  },
  {
    "name": "FB模型",
    "data": [{"value": "1111111", "name": "2022-07-01(星期五)"}, {
      "value": "1111111",
      "name": "2022-07-02(星期六)",
    }, {"value": "1111111", "name": "2022-07-03(星期日)"}, {
      "value": "1111111",
      "name": "2022-07-04(星期一)",
    }, {"value": "1111111", "name": "2022-07-05(星期二)"}, {
      "value": "1111111",
      "name": "2022-07-06(星期三)",
    }, {"value": "1111111", "name": "2022-07-07(星期四)"}, {
      "value": "1111111",
      "name": "2022-07-08(星期五)",
    }, {"value": "1111111", "name": "2022-07-09(星期六)"}, {
      "value": "1111111",
      "name": "2022-07-10(星期日)",
    }, {"value": "1111111", "name": "2022-07-11(星期一)"}, {
      "value": "1111111",
      "name": "2022-07-12(星期二)",
    }, {"value": "1111111", "name": "2022-07-13(星期三)"}, {
      "value": "1111111",
      "name": "2022-07-14(星期四)",
    }, {"value": "1111111", "name": "2022-07-15(星期五)"}, {
      "value": "1111111",
      "name": "2022-07-16(星期六)",
    }, {"value": "1111111", "name": "2022-07-17(星期日)"}, {
      "value": "1111111",
      "name": "2022-07-18(星期一)",
    }, {"value": "1111111", "name": "2022-07-19(星期二)"}, {
      "value": "1111111",
      "name": "2022-07-20(星期三)",
    }, {"value": "1111111", "name": "2022-07-21(星期四)"}, {
      "value": "1111111",
      "name": "2022-07-22(星期五)",
    }, {"value": "1111111", "name": "2022-07-23(星期六)"}, {
      "value": "1111111",
      "name": "2022-07-24(星期日)",
    }, {"value": "1111111", "name": "2022-07-25(星期一)"}, {
      "value": "1111111",
      "name": "2022-07-26(星期二)",
    }, {"value": "1111111", "name": "2022-07-27(星期三)"}, {
      "value": "1111111",
      "name": "2022-07-28(星期四)",
    }, {"value": "1111111", "name": "2022-07-29(星期五)"}, {
      "value": "1111111",
      "name": "2022-07-30(星期六)",
    }, {"value": "1111111", "name": "2022-07-31(星期日)"}, {
      "value": "1111111",
      "name": "2022-08-01(星期一)",
    }, {"value": "1111111", "name": "2022-08-02(星期二)"}, {
      "value": "1111111",
      "name": "2022-08-03(星期三)",
    }, {"value": "1111111", "name": "2022-08-04(星期四)"}, {
      "value": "1111111",
      "name": "2022-08-05(星期五)",
    }, {"value": "1111111", "name": "2022-08-06(星期六)"}, {
      "value": "1111111",
      "name": "2022-08-07(星期日)",
    }, {"value": "1111111", "name": "2022-08-08(星期一)"}, {
      "value": "1111111",
      "name": "2022-08-09(星期二)",
    }, {"value": "1111112", "name": "2022-08-10(星期三)"}, {
      "value": "1111113",
      "name": "2022-08-11(星期四)",
    }, {"value": "1111114", "name": "2022-08-12(星期五)"}, {
      "value": "1111115",
      "name": "2022-08-13(星期六)",
    }, {"value": "1111111", "name": "2022-08-14(星期日)"}, {
      "value": "1111111",
      "name": "2022-08-15(星期一)",
    }, {"value": "1111111", "name": "2022-08-16(星期二)"}, {
      "value": "1111111",
      "name": "2022-08-17(星期三)",
    }, {"value": "1111111", "name": "2022-08-18(星期四)"}, {
      "value": "1111111",
      "name": "2022-08-19(星期五)",
    }, {"value": "1111111", "name": "2022-08-20(星期六)"}, {
      "value": "1111111",
      "name": "2022-08-21(星期日)",
    }, {"value": "1111111", "name": "2022-08-22(星期一)"}, {
      "value": "1111111",
      "name": "2022-08-23(星期二)",
    }, {"value": "1111111", "name": "2022-08-24(星期三)"}, {
      "value": "1111111",
      "name": "2022-08-25(星期四)",
    }, {"value": "1111111", "name": "2022-08-26(星期五)"}, {
      "value": "1111111",
      "name": "2022-08-27(星期六)",
    }, {"value": "1111111", "name": "2022-08-28(星期日)"}, {
      "value": "1111111",
      "name": "2022-08-29(星期一)",
    }, {"value": "1111111", "name": "2022-08-30(星期二)"}, {"value": "1111111", "name": "2022-08-31(星期三)"}],
  },
  {
    "name": "今年",
    "data": [{"value": "11440", "name": "2022-07-01(星期五)"}, {
      "value": "11440",
      "name": "2022-07-02(星期六)",
    }, {"value": "11440", "name": "2022-07-03(星期日)"}, {
      "value": "11330",
      "name": "2022-07-04(星期一)",
    }, {"value": "2791683", "name": "2022-07-05(星期二)"}, {
      "value": "2791683",
      "name": "2022-07-06(星期三)",
    }, {"value": "11440", "name": "2022-07-07(星期四)"}, {
      "value": "11440",
      "name": "2022-07-08(星期五)",
    }, {"value": "11440", "name": "2022-07-09(星期六)"}, {
      "value": "11440",
      "name": "2022-07-10(星期日)",
    }, {"value": "11440", "name": "2022-07-11(星期一)"}, {
      "value": "11440",
      "name": "2022-07-12(星期二)",
    }, {"value": "11440", "name": "2022-07-13(星期三)"}, {
      "value": "38927387",
      "name": "2022-07-14(星期四)",
    }, {"value": "32727399", "name": "2022-07-15(星期五)"}, {
      "value": "13237892",
      "name": "2022-07-16(星期六)",
    }, {"value": "32324111", "name": "2022-07-17(星期日)"}, {
      "value": "37287123",
      "name": "2022-07-18(星期一)",
    }, {"value": "1143340", "name": "2022-07-19(星期二)"}, {
      "value": "1143340",
      "name": "2022-07-20(星期三)",
    }, {"value": "29382333", "name": "2022-07-21(星期四)"}, {
      "value": "29382333",
      "name": "2022-07-22(星期五)",
    }, {"value": "29382333", "name": "2022-07-23(星期六)"}, {
      "value": "29382333",
      "name": "2022-07-24(星期日)",
    }, {"value": "20932748", "name": "2022-07-25(星期一)"}, {
      "value": "29382333",
      "name": "2022-07-26(星期二)",
    }, {"value": "29382333", "name": "2022-07-27(星期三)"}, {
      "value": "32032478",
      "name": "2022-07-28(星期四)",
    }, {"value": "42237738", "name": "2022-07-29(星期五)"}, {
      "value": "11273873",
      "name": "2022-07-30(星期六)",
    }, {"value": "20392877", "name": "2022-07-31(星期日)"}, {
      "value": "11440",
      "name": "2022-08-01(星期一)",
    }, {"value": "11440", "name": "2022-08-02(星期二)"}, {
      "value": "11440",
      "name": "2022-08-03(星期三)",
    }, {"value": "11330", "name": "2022-08-04(星期四)"}, {
      "value": "2791683",
      "name": "2022-08-05(星期五)",
    }, {"value": "2791683", "name": "2022-08-06(星期六)"}, {
      "value": "11440",
      "name": "2022-08-07(星期日)",
    }, {"value": "11440", "name": "2022-08-08(星期一)"}, {
      "value": "11440",
      "name": "2022-08-09(星期二)",
    }, {"value": "11440", "name": "2022-08-10(星期三)"}, {
      "value": "11440",
      "name": "2022-08-11(星期四)",
    }, {"value": "11440", "name": "2022-08-12(星期五)"}, {
      "value": "11440",
      "name": "2022-08-13(星期六)",
    }, {"value": "38927387", "name": "2022-08-14(星期日)"}, {
      "value": "38927387",
      "name": "2022-08-15(星期一)",
    }, {"value": "38927387", "name": "2022-08-16(星期二)"}, {
      "value": "38927387",
      "name": "2022-08-17(星期三)",
    }, {"value": "14988767", "name": "2022-08-18(星期四)"}, {
      "value": "12086641",
      "name": "2022-08-19(星期五)",
    }, {"value": "11340001", "name": "2022-08-20(星期六)"}, {
      "value": "14376279",
      "name": "2022-08-21(星期日)",
    }, {"value": "14376279", "name": "2022-08-22(星期一)"}, {
      "value": null,
      "name": "2022-08-23(星期二)",
    }, {"value": null, "name": "2022-08-24(星期三)"}, {"value": null, "name": "2022-08-25(星期四)"}, {
      "value": null,
      "name": "2022-08-26(星期五)",
    }, {"value": null, "name": "2022-08-27(星期六)"}, {"value": null, "name": "2022-08-28(星期日)"}, {
      "value": null,
      "name": "2022-08-29(星期一)",
    }, {"value": null, "name": "2022-08-30(星期二)"}, {"value": null, "name": "2022-08-31(星期三)"}],
  },
  {
    "name": "去年",
    "data": [{"value": "3333333", "name": "2021-07-02(星期五)"}, {
      "value": "3333333",
      "name": "2021-07-03(星期六)",
    }, {"value": "3333333", "name": "2021-07-04(星期日)"}, {
      "value": "3333333",
      "name": "2021-07-05(星期一)",
    }, {"value": "3333333", "name": "2021-07-06(星期二)"}, {
      "value": "3333333",
      "name": "2021-07-07(星期三)",
    }, {"value": "3333333", "name": "2021-07-08(星期四)"}, {
      "value": "3333333",
      "name": "2021-07-09(星期五)",
    }, {"value": "3333333", "name": "2021-07-10(星期六)"}, {
      "value": "3333333",
      "name": "2021-07-11(星期日)",
    }, {"value": "3333333", "name": "2021-07-12(星期一)"}, {
      "value": "3333333",
      "name": "2021-07-13(星期二)",
    }, {"value": "3333333", "name": "2021-07-14(星期三)"}, {
      "value": "3333333",
      "name": "2021-07-15(星期四)",
    }, {"value": "3333333", "name": "2021-07-16(星期五)"}, {
      "value": "3333333",
      "name": "2021-07-17(星期六)",
    }, {"value": "3333333", "name": "2021-07-18(星期日)"}, {
      "value": "3333333",
      "name": "2021-07-19(星期一)",
    }, {"value": "3333333", "name": "2021-07-20(星期二)"}, {
      "value": "3333333",
      "name": "2021-07-21(星期三)",
    }, {"value": "3333333", "name": "2021-07-22(星期四)"}, {
      "value": "3333333",
      "name": "2021-07-23(星期五)",
    }, {"value": "3333333", "name": "2021-07-24(星期六)"}, {
      "value": "3333333",
      "name": "2021-07-25(星期日)",
    }, {"value": "3333333", "name": "2021-07-26(星期一)"}, {
      "value": "3333333",
      "name": "2021-07-27(星期二)",
    }, {"value": "3333333", "name": "2021-07-28(星期三)"}, {
      "value": "3333333",
      "name": "2021-07-29(星期四)",
    }, {"value": "3333333", "name": "2021-07-30(星期五)"}, {
      "value": "3333333",
      "name": "2021-07-31(星期六)",
    }, {"value": "3333333", "name": "2021-08-01(星期日)"}, {
      "value": "3333333",
      "name": "2021-08-02(星期一)",
    }, {"value": "3333333", "name": "2021-08-03(星期二)"}, {
      "value": "3333333",
      "name": "2021-08-04(星期三)",
    }, {"value": "3334299", "name": "2021-08-05(星期四)"}, {
      "value": "2519621",
      "name": "2021-08-06(星期五)",
    }, {"value": "2551661", "name": "2021-08-07(星期六)"}, {
      "value": "2551661",
      "name": "2021-08-08(星期日)",
    }, {"value": "2551661", "name": "2021-08-09(星期一)"}, {
      "value": "2551661",
      "name": "2021-08-10(星期二)",
    }, {"value": "2551661", "name": "2021-08-11(星期三)"}, {
      "value": "2551661",
      "name": "2021-08-12(星期四)",
    }, {"value": "2551661", "name": "2021-08-13(星期五)"}, {
      "value": "2551661",
      "name": "2021-08-14(星期六)",
    }, {"value": "2551661", "name": "2021-08-15(星期日)"}, {
      "value": "2551661",
      "name": "2021-08-16(星期一)",
    }, {"value": "2551661", "name": "2021-08-17(星期二)"}, {
      "value": "2551661",
      "name": "2021-08-18(星期三)",
    }, {"value": "2551661", "name": "2021-08-19(星期四)"}, {
      "value": "2551661",
      "name": "2021-08-20(星期五)",
    }, {"value": "2551661", "name": "2021-08-21(星期六)"}, {
      "value": "2551661",
      "name": "2021-08-22(星期日)",
    }, {"value": "2551661", "name": "2021-08-23(星期一)"}, {
      "value": "2551661",
      "name": "2021-08-24(星期二)",
    }, {"value": "2551661", "name": "2021-08-25(星期三)"}, {
      "value": "2551661",
      "name": "2021-08-26(星期四)",
    }, {"value": "2551661", "name": "2021-08-27(星期五)"}, {
      "value": "2551661",
      "name": "2021-08-28(星期六)",
    }, {"value": "2551661", "name": "2021-08-29(星期日)"}, {
      "value": "2551661",
      "name": "2021-08-30(星期一)",
    }, {"value": "2551661", "name": "2021-08-31(星期二)"}, {"value": "3334299", "name": "2021-09-01(星期三)"}],
  },
  {
    "name": "前年",
    "data": [{"value": "8953096", "name": "2020-07-03(星期五)"}, {
      "value": "8270698",
      "name": "2020-07-04(星期六)",
    }, {"value": "6720362", "name": "2020-07-05(星期日)"}, {
      "value": "9926303",
      "name": "2020-07-06(星期一)",
    }, {"value": "9599827", "name": "2020-07-07(星期二)"}, {
      "value": "10115924",
      "name": "2020-07-08(星期三)",
    }, {"value": "10641007", "name": "2020-07-09(星期四)"}, {
      "value": "9661682",
      "name": "2020-07-10(星期五)",
    }, {"value": "9044122", "name": "2020-07-11(星期六)"}, {
      "value": "8008287",
      "name": "2020-07-12(星期日)",
    }, {"value": "9768689", "name": "2020-07-13(星期一)"}, {
      "value": "8532898",
      "name": "2020-07-14(星期二)",
    }, {"value": "8777807", "name": "2020-07-15(星期三)"}, {
      "value": "9751142",
      "name": "2020-07-16(星期四)",
    }, {"value": "9635636", "name": "2020-07-17(星期五)"}, {
      "value": "8445398",
      "name": "2020-07-18(星期六)",
    }, {"value": "8042058", "name": "2020-07-19(星期日)"}, {
      "value": "10832879",
      "name": "2020-07-20(星期一)",
    }, {"value": "10010240", "name": "2020-07-21(星期二)"}, {
      "value": "9246450",
      "name": "2020-07-22(星期三)",
    }, {"value": "9243523", "name": "2020-07-23(星期四)"}, {
      "value": "8883455",
      "name": "2020-07-24(星期五)",
    }, {"value": "8102983", "name": "2020-07-25(星期六)"}, {
      "value": "7414057",
      "name": "2020-07-26(星期日)",
    }, {"value": "9705442", "name": "2020-07-27(星期一)"}, {
      "value": "8505966",
      "name": "2020-07-28(星期二)",
    }, {"value": "8523888", "name": "2020-07-29(星期三)"}, {
      "value": "8575895",
      "name": "2020-07-30(星期四)",
    }, {"value": "8479901", "name": "2020-07-31(星期五)"}, {
      "value": "7904002",
      "name": "2020-08-01(星期六)",
    }, {"value": "7313982", "name": "2020-08-02(星期日)"}, {
      "value": "10096053",
      "name": "2020-08-03(星期一)",
    }, {"value": "8259426", "name": "2020-08-04(星期二)"}, {
      "value": "8079436",
      "name": "2020-08-05(星期三)",
    }, {"value": "8455695", "name": "2020-08-06(星期四)"}, {
      "value": "7963693",
      "name": "2020-08-07(星期五)",
    }, {"value": "7590252", "name": "2020-08-08(星期六)"}, {
      "value": "6963672",
      "name": "2020-08-09(星期日)",
    }, {"value": "9463615", "name": "2020-08-10(星期一)"}, {
      "value": "7779965",
      "name": "2020-08-11(星期二)",
    }, {"value": "7586094", "name": "2020-08-12(星期三)"}, {
      "value": "7832598",
      "name": "2020-08-13(星期四)",
    }, {"value": "7582902", "name": "2020-08-14(星期五)"}, {
      "value": "7096530",
      "name": "2020-08-15(星期六)",
    }, {"value": "6760823", "name": "2020-08-16(星期日)"}, {
      "value": "9438174",
      "name": "2020-08-17(星期一)",
    }, {"value": "7948111", "name": "2020-08-18(星期二)"}, {
      "value": "7188889",
      "name": "2020-08-19(星期三)",
    }, {"value": "7503041", "name": "2020-08-20(星期四)"}, {
      "value": "7449431",
      "name": "2020-08-21(星期五)",
    }, {"value": "7005110", "name": "2020-08-22(星期六)"}, {
      "value": "6814415",
      "name": "2020-08-23(星期日)",
    }, {"value": "8666614", "name": "2020-08-24(星期一)"}, {
      "value": "7230938",
      "name": "2020-08-25(星期二)",
    }, {"value": "6934086", "name": "2020-08-26(星期三)"}, {
      "value": "7265622",
      "name": "2020-08-27(星期四)",
    }, {"value": "7229951", "name": "2020-08-28(星期五)"}, {
      "value": "6705025",
      "name": "2020-08-29(星期六)",
    }, {"value": "6555768", "name": "2020-08-30(星期日)"}, {
      "value": "8681007",
      "name": "2020-08-31(星期一)",
    }, {"value": "7339373", "name": "2020-09-01(星期二)"}, {"value": "7132812", "name": "2020-09-02(星期三)"}],
  },
  {
    "name": "大前年",
    "data": [{"value": "1818886", "name": "2019-07-05(星期五)"}, {
      "value": "1579402",
      "name": "2019-07-06(星期六)",
    }, {"value": "1469936", "name": "2019-07-07(星期日)"}, {
      "value": "1983537",
      "name": "2019-07-08(星期一)",
    }, {"value": "1778539", "name": "2019-07-09(星期二)"}, {
      "value": "1713667",
      "name": "2019-07-10(星期三)",
    }, {"value": "1745000", "name": "2019-07-11(星期四)"}, {
      "value": "1772424",
      "name": "2019-07-12(星期五)",
    }, {"value": "1633339", "name": "2019-07-13(星期六)"}, {
      "value": "1448111",
      "name": "2019-07-14(星期日)",
    }, {"value": "2000602", "name": "2019-07-15(星期一)"}, {
      "value": "1802662",
      "name": "2019-07-16(星期二)",
    }, {"value": "1714428", "name": "2019-07-17(星期三)"}, {
      "value": "1768551",
      "name": "2019-07-18(星期四)",
    }, {"value": "1756150", "name": "2019-07-19(星期五)"}, {
      "value": "1624079",
      "name": "2019-07-20(星期六)",
    }, {"value": "1434331", "name": "2019-07-21(星期日)"}, {
      "value": "2103453",
      "name": "2019-07-22(星期一)",
    }, {"value": "1700703", "name": "2019-07-23(星期二)"}, {
      "value": "1685405",
      "name": "2019-07-24(星期三)",
    }, {"value": "1736797", "name": "2019-07-25(星期四)"}, {
      "value": "1737070",
      "name": "2019-07-26(星期五)",
    }, {"value": "1543749", "name": "2019-07-27(星期六)"}, {
      "value": "1382448",
      "name": "2019-07-28(星期日)",
    }, {"value": "1972452", "name": "2019-07-29(星期一)"}, {
      "value": "1685829",
      "name": "2019-07-30(星期二)",
    }, {"value": "1618509", "name": "2019-07-31(星期三)"}, {
      "value": "1769273",
      "name": "2019-08-01(星期四)",
    }, {"value": "1715205", "name": "2019-08-02(星期五)"}, {
      "value": "1634666",
      "name": "2019-08-03(星期六)",
    }, {"value": "1456242", "name": "2019-08-04(星期日)"}, {
      "value": "2007086",
      "name": "2019-08-05(星期一)",
    }, {"value": "1739611", "name": "2019-08-06(星期二)"}, {
      "value": "1691057",
      "name": "2019-08-07(星期三)",
    }, {"value": "1739733", "name": "2019-08-08(星期四)"}, {
      "value": "1693849",
      "name": "2019-08-09(星期五)",
    }, {"value": "1568188", "name": "2019-08-10(星期六)"}, {
      "value": "1373375",
      "name": "2019-08-11(星期日)",
    }, {"value": "1950351", "name": "2019-08-12(星期一)"}, {
      "value": "1726089",
      "name": "2019-08-13(星期二)",
    }, {"value": "1579338", "name": "2019-08-14(星期三)"}, {
      "value": "1547640",
      "name": "2019-08-15(星期四)",
    }, {"value": "1723723", "name": "2019-08-16(星期五)"}, {
      "value": "1540390",
      "name": "2019-08-17(星期六)",
    }, {"value": "1450190", "name": "2019-08-18(星期日)"}, {
      "value": "1995599",
      "name": "2019-08-19(星期一)",
    }, {"value": "1681402", "name": "2019-08-20(星期二)"}, {
      "value": "1600466",
      "name": "2019-08-21(星期三)",
    }, {"value": "1676259", "name": "2019-08-22(星期四)"}, {
      "value": "1639434",
      "name": "2019-08-23(星期五)",
    }, {"value": "1471690", "name": "2019-08-24(星期六)"}, {
      "value": "1354168",
      "name": "2019-08-25(星期日)",
    }, {"value": "1876780", "name": "2019-08-26(星期一)"}, {
      "value": "1498853",
      "name": "2019-08-27(星期二)",
    }, {"value": "1440765", "name": "2019-08-28(星期三)"}, {
      "value": "1528876",
      "name": "2019-08-29(星期四)",
    }, {"value": "1434090", "name": "2019-08-30(星期五)"}, {
      "value": "1411088",
      "name": "2019-08-31(星期六)",
    }, {"value": "1433277", "name": "2019-09-01(星期日)"}, {
      "value": "1841316",
      "name": "2019-09-02(星期一)",
    }, {"value": "2010707", "name": "2019-09-03(星期二)"}, {"value": "1436161", "name": "2019-09-04(星期三)"}],
  },
];
