// 42
export const rainFallTestData1 = [
  {
    // eighteenRainfall: 9996,
    name: 1, eighteenRainfall: 7586, nineteenRainfall: 2348,
    historyRainfall: 5437, futureRainfall: 4346, testRainfall: 8234,
  },
  {
    name: 2, eighteenRainfall: 8765, nineteenRainfall: 7343,
    historyRainfall: 5235, futureRainfall: 3612, testRainfall: 7895,
  },
  {
    name: 3, eighteenRainfall: 7654, nineteenRainfall: 4372,
    historyRainfall: 3893, futureRainfall: 1784, testRainfall: 9035,
  },
  {
    name: 4, eighteenRainfall: 6543, nineteenRainfall: 4726,
    historyRainfall: 3727, futureRainfall: 6538, testRainfall: 6239,
  },
  {
    name: 5, eighteenRainfall: 5432, nineteenRainfall: 6632,
    historyRainfall: 2891, futureRainfall: 5233, testRainfall: 8454,
  },
  {
    name: 6, eighteenRainfall: 5348, nineteenRainfall: 8925,
    historyRainfall: 8476, futureRainfall: 3437, testRainfall: 7648,
  },
  {
    name: 7, eighteenRainfall: 2348, nineteenRainfall: 7925,
    historyRainfall: 8976, futureRainfall: 2417, testRainfall: 6448,
    // nineteenRainfall: null as any, historyRainfall: null as any, futureRainfall: null as any, testRainfall: null as any,
  },
];

// 84
export const rainFallTestData2 = [
  {
    name: 1,
    data: [
      {seriesName: "2018月累计降水量", value: 7586},
      {seriesName: "2019月累计降水量", value: 2348}, {seriesName: "历史月累计降水量", value: 5437},
      {seriesName: "未来月累计降水量", value: 4346}, {seriesName: "测试月累计降水量", value: 8234},
    ],
  },
  {
    name: 2,
    data: [
      {seriesName: "2018月累计降水量", value: 8765},
      {seriesName: "2019月累计降水量", value: 7343}, {seriesName: "历史月累计降水量", value: 5235},
      {seriesName: "未来月累计降水量", value: 3612}, {seriesName: "测试月累计降水量", value: 7895},
    ],
  },
  {
    name: 3,
    data: [
      {seriesName: "2018月累计降水量", value: 7654},
      {seriesName: "2019月累计降水量", value: 4372}, {seriesName: "历史月累计降水量", value: 3893},
      {seriesName: "未来月累计降水量", value: 1784}, {seriesName: "测试月累计降水量", value: 9035},
    ],
  },
  {
    name: 4,
    data: [
      {seriesName: "2018月累计降水量", value: 6543},
      {seriesName: "2019月累计降水量", value: 4726}, {seriesName: "历史月累计降水量", value: 3727},
      {seriesName: "未来月累计降水量", value: 6538}, {seriesName: "测试月累计降水量", value: 6239},
    ],
  },
  {
    name: 5,
    data: [
      {seriesName: "2018月累计降水量", value: 5432},
      {seriesName: "2019月累计降水量", value: 6632}, {seriesName: "历史月累计降水量", value: 2891},
      {seriesName: "未来月累计降水量", value: 5233}, {seriesName: "测试月累计降水量", value: 8454},
    ],
  },
  {
    name: 6,
    data: [
      {seriesName: "2018月累计降水量", value: 5348},
      {seriesName: "2019月累计降水量", value: 8925}, {seriesName: "历史月累计降水量", value: 8476},
      {seriesName: "未来月累计降水量", value: 3437}, {seriesName: "测试月累计降水量", value: 7648},
    ],
  },
  {
    name: 7,
    data: [
      {seriesName: "2018月累计降水量", value: 2348},
      {seriesName: "2019月累计降水量", value: 7925}, {seriesName: "历史月累计降水量", value: 8976},
      {seriesName: "未来月累计降水量", value: 2417}, {seriesName: "测试月累计降水量", value: 6448},
    ],
  },
];

// 105
export const rainFallTestData3 = [
  /** 2018月累计降水量 */
  {name: 1, seriesName: "2018月累计降水量", value: 7586},
  {name: 2, seriesName: "2018月累计降水量", value: 8765},
  {name: 3, seriesName: "2018月累计降水量", value: 7654},
  {name: 4, seriesName: "2018月累计降水量", value: 6543},
  {name: 5, seriesName: "2018月累计降水量", value: 5432},
  {name: 6, seriesName: "2018月累计降水量", value: 5348},
  {name: 7, seriesName: "2018月累计降水量", value: 2348},
  /** 2019月累计降水量 */
  {name: 1, seriesName: "2019月累计降水量", value: 2348},
  {name: 2, seriesName: "2019月累计降水量", value: 7343},
  {name: 3, seriesName: "2019月累计降水量", value: 4372},
  {name: 4, seriesName: "2019月累计降水量", value: 4726},
  {name: 5, seriesName: "2019月累计降水量", value: 6632},
  {name: 6, seriesName: "2019月累计降水量", value: 8925},
  {name: 7, seriesName: "2019月累计降水量", value: 7925},
  /** 历史月累计降水量 */
  {name: 1, seriesName: "历史月累计降水量", value: 5437},
  {name: 2, seriesName: "历史月累计降水量", value: 5235},
  {name: 3, seriesName: "历史月累计降水量", value: 3893},
  {name: 4, seriesName: "历史月累计降水量", value: 3727},
  {name: 5, seriesName: "历史月累计降水量", value: 2891},
  {name: 6, seriesName: "历史月累计降水量", value: 8476},
  {name: 7, seriesName: "历史月累计降水量", value: 8976},
  /** 未来月累计降水量 */
  {name: 1, seriesName: "未来月累计降水量", value: 4346},
  {name: 2, seriesName: "未来月累计降水量", value: 3612},
  {name: 3, seriesName: "未来月累计降水量", value: 1784},
  {name: 4, seriesName: "未来月累计降水量", value: 6538},
  {name: 5, seriesName: "未来月累计降水量", value: 5233},
  {name: 6, seriesName: "未来月累计降水量", value: 3437},
  {name: 7, seriesName: "未来月累计降水量", value: 2417},
  /** 测试月累计降水量 */
  {name: 1, seriesName: "测试月累计降水量", value: 8234},
  {name: 2, seriesName: "测试月累计降水量", value: 7895},
  {name: 3, seriesName: "测试月累计降水量", value: 9035},
  {name: 4, seriesName: "测试月累计降水量", value: 6239},
  {name: 5, seriesName: "测试月累计降水量", value: 8454},
  {name: 6, seriesName: "测试月累计降水量", value: 7648},
  {name: 7, seriesName: "测试月累计降水量", value: 6448},
];

// 80
export const rainFallTestData4 = [
  {
    name: "2018月累计降水量",
    data: [
      {name: 1, value: 7586},
      {name: 2, value: 8765},
      {name: 3, value: 7654},
      {name: 4, value: 6543},
      {name: 5, value: 5432},
      {name: 6, value: 5348},
      {name: 7, value: 2348},
    ],
  },
  {
    name: "2019月累计降水量",
    data: [
      {name: 1, value: 2348},
      {name: 2, value: 7343},
      {name: 3, value: 4372},
      {name: 4, value: 4726},
      {name: 5, value: 6632},
      {name: 6, value: 8925},
      {name: 7, value: 7925},
    ],
  },
  {
    name: "历史月累计降水量",
    data: [
      {name: 1, value: 5437},
      {name: 2, value: 5235},
      {name: 3, value: 3893},
      {name: 4, value: 3727},
      {name: 5, value: 2891},
      {name: 6, value: 8476},
      {name: 7, value: 8976},
    ],
  },
  {
    name: "未来月累计降水量",
    data: [
      {name: 1, value: 4346},
      {name: 2, value: 3612},
      {name: 3, value: 1784},
      {name: 4, value: 6538},
      {name: 5, value: 5233},
      {name: 6, value: 3437},
      {name: 7, value: 2417},
    ],
  },
  {
    name: "测试月累计降水量",
    data: [
      {name: 1, value: 8234},
      {name: 2, value: 7895},
      {name: 3, value: 9035},
      {name: 4, value: 6239},
      {name: 5, value: 8454},
      {name: 6, value: 7648},
      {name: 7, value: 6448},
    ],
  },
];

export const testData1 = [
  {
    name: "衣物衣物衣物衣物衣物销量",
    data: [
      { name: "衬衫", value: 50 },
      { name: "羊毛衫", value: 200 },
      { name: "雪纺衫", value: 360 },
      { name: "裤子", value: 100 },
      { name: "高跟鞋", value: 100 },
      { name: "袜子", value: 560 },
    ],
  },
  {
    name: "衣物衣物衣物衣物衣物库存",
    data: [
      { name: "衬衫", value: 20 },
      { name: "羊毛衫", value: 90 },
      { name: "雪纺衫", value: 170 },
      { name: "裤子", value: 30 },
      { name: "高跟鞋", value: 208 },
      { name: "袜子", value: 120 },
    ],
  },
  {
    name: "衣物衣物衣物衣物衣物破损",
    data: [
      { name: "衬衫", value: 50 },
      { name: "羊毛衫", value: 230 },
      { name: "雪纺衫", value: 80 },
      { name: "裤子", value: 101 },
      { name: "高跟鞋", value: 70 },
      { name: "袜子", value: 302 },
    ],
  },
  {
    name: "衣物衣物衣物衣物衣物回退",
    data: [
      { name: "衬衫", value: 37 },
      { name: "羊毛衫", value: 113 },
      { name: "雪纺衫", value: 59 },
      { name: "裤子", value: 91 },
      { name: "高跟鞋", value: 34 },
      { name: "袜子", value: 207 },
    ],
  },
];

export const testCategoryData = ["2022-07-01", "2022-07-02", "2022-07-03", "2022-07-04", "2022-07-05", "2022-07-06", "2022-07-07", "2022-07-08", "2022-07-09", "2022-07-10", "2022-07-11", "2022-07-12", "2022-07-13", "2022-07-14", "2022-07-15", "2022-07-16", "2022-07-17", "2022-07-18", "2022-07-19", "2022-07-20", "2022-07-21", "2022-07-22", "2022-07-23", "2022-07-24", "2022-07-25", "2022-07-26", "2022-07-27", "2022-07-28", "2022-07-29", "2022-07-30", "2022-07-31", "2022-08-01", "2022-08-02", "2022-08-03", "2022-08-04", "2022-08-05", "2022-08-06", "2022-08-07", "2022-08-08", "2022-08-09", "2022-08-10", "2022-08-11", "2022-08-12", "2022-08-13", "2022-08-14", "2022-08-15", "2022-08-16", "2022-08-17", "2022-08-18", "2022-08-19", "2022-08-20", "2022-08-21", "2022-08-22", "2022-08-23", "2022-08-24", "2022-08-25", "2022-08-26", "2022-08-27", "2022-08-28", "2022-08-29", "2022-08-30", "2022-08-31"];

export const testData2 = [
  {
    "name": "本次",
    "data": [
      {"value": null, "name": "2022-07-01(星期五)"}, {
        "value": null,
        "name": "2022-07-02(星期六)",
      }, {"value": null, "name": "2022-07-03(星期日)"}, {"value": null, "name": "2022-07-04(星期一)"}, {
        "value": null,
        "name": "2022-07-05(星期二)",
      }, {"value": null, "name": "2022-07-06(星期三)"}, {"value": null, "name": "2022-07-07(星期四)"}, {
        "value": null,
        "name": "2022-07-08(星期五)",
      }, {"value": null, "name": "2022-07-09(星期六)"}, {"value": null, "name": "2022-07-10(星期日)"}, {
        "value": null,
        "name": "2022-07-11(星期一)",
      }, {"value": null, "name": "2022-07-12(星期二)"}, {"value": null, "name": "2022-07-13(星期三)"}, {
        "value": null,
        "name": "2022-07-14(星期四)",
      }, {"value": null, "name": "2022-07-15(星期五)"}, {"value": null, "name": "2022-07-16(星期六)"}, {
        "value": null,
        "name": "2022-07-17(星期日)",
      }, {"value": null, "name": "2022-07-18(星期一)"}, {"value": null, "name": "2022-07-19(星期二)"}, {
        "value": null,
        "name": "2022-07-20(星期三)",
      }, {"value": null, "name": "2022-07-21(星期四)"}, {"value": null, "name": "2022-07-22(星期五)"}, {
        "value": null,
        "name": "2022-07-23(星期六)",
      }, {"value": null, "name": "2022-07-24(星期日)"}, {"value": null, "name": "2022-07-25(星期一)"}, {
        "value": null,
        "name": "2022-07-26(星期二)",
      }, {"value": null, "name": "2022-07-27(星期三)"}, {"value": null, "name": "2022-07-28(星期四)"}, {
        "value": null,
        "name": "2022-07-29(星期五)",
      }, {"value": null, "name": "2022-07-30(星期六)"}, {"value": null, "name": "2022-07-31(星期日)"}, {
        "value": null,
        "name": "2022-08-01(星期一)",
      }, {"value": null, "name": "2022-08-02(星期二)"}, {"value": null, "name": "2022-08-03(星期三)"}, {
        "value": null,
        "name": "2022-08-04(星期四)",
      }, {"value": null, "name": "2022-08-05(星期五)"}, {"value": null, "name": "2022-08-06(星期六)"}, {
        "value": null,
        "name": "2022-08-07(星期日)",
      }, {"value": null, "name": "2022-08-08(星期一)"}, {"value": null, "name": "2022-08-09(星期二)"}, {
        "value": null,
        "name": "2022-08-10(星期三)",
      }, {"value": null, "name": "2022-08-11(星期四)"}, {"value": null, "name": "2022-08-12(星期五)"}, {
        "value": null,
        "name": "2022-08-13(星期六)",
      }, {"value": null, "name": "2022-08-14(星期日)"}, {"value": null, "name": "2022-08-15(星期一)"}, {
        "value": null,
        "name": "2022-08-16(星期二)",
      }, {"value": null, "name": "2022-08-17(星期三)"}, {"value": null, "name": "2022-08-18(星期四)"}, {
        "value": null,
        "name": "2022-08-19(星期五)",
      }, {"value": null, "name": "2022-08-20(星期六)"}, {"value": null, "name": "2022-08-21(星期日)"}, {
        "value": null,
        "name": "2022-08-22(星期一)",
      }, {"value": null, "name": "2022-08-23(星期二)"}, {"value": null, "name": "2022-08-24(星期三)"}, {
        "value": null,
        "name": "2022-08-25(星期四)",
      }, {"value": null, "name": "2022-08-26(星期五)"}, {"value": null, "name": "2022-08-27(星期六)"}, {
        "value": null,
        "name": "2022-08-28(星期日)",
      }, {"value": null, "name": "2022-08-29(星期一)"}, {"value": null, "name": "2022-08-30(星期二)"}, {
        "value": null,
        "name": "2022-08-31(星期三)",
      }],
  },
  {
    "name": "市场",
    "data": [
      {"value": null, "name": "2022-07-01(星期五)"}, {
        "value": null,
        "name": "2022-07-02(星期六)",
      }, {"value": null, "name": "2022-07-03(星期日)"}, {"value": null, "name": "2022-07-04(星期一)"}, {
        "value": null,
        "name": "2022-07-05(星期二)",
      }, {"value": null, "name": "2022-07-06(星期三)"}, {"value": null, "name": "2022-07-07(星期四)"}, {
        "value": null,
        "name": "2022-07-08(星期五)",
      }, {"value": null, "name": "2022-07-09(星期六)"}, {"value": null, "name": "2022-07-10(星期日)"}, {
        "value": null,
        "name": "2022-07-11(星期一)",
      }, {"value": null, "name": "2022-07-12(星期二)"}, {"value": null, "name": "2022-07-13(星期三)"}, {
        "value": null,
        "name": "2022-07-14(星期四)",
      }, {"value": null, "name": "2022-07-15(星期五)"}, {"value": null, "name": "2022-07-16(星期六)"}, {
        "value": null,
        "name": "2022-07-17(星期日)",
      }, {"value": null, "name": "2022-07-18(星期一)"}, {"value": null, "name": "2022-07-19(星期二)"}, {
        "value": null,
        "name": "2022-07-20(星期三)",
      }, {"value": null, "name": "2022-07-21(星期四)"}, {"value": null, "name": "2022-07-22(星期五)"}, {
        "value": null,
        "name": "2022-07-23(星期六)",
      }, {"value": null, "name": "2022-07-24(星期日)"}, {"value": null, "name": "2022-07-25(星期一)"}, {
        "value": null,
        "name": "2022-07-26(星期二)",
      }, {"value": null, "name": "2022-07-27(星期三)"}, {"value": null, "name": "2022-07-28(星期四)"}, {
        "value": null,
        "name": "2022-07-29(星期五)",
      }, {"value": null, "name": "2022-07-30(星期六)"}, {"value": null, "name": "2022-07-31(星期日)"}, {
        "value": "11440",
        "name": "2022-08-01(星期一)",
      }, {"value": "11440", "name": "2022-08-02(星期二)"}, {
        "value": "11440",
        "name": "2022-08-03(星期三)",
      }, {"value": "11330", "name": "2022-08-04(星期四)"}, {
        "value": "2791682",
        "name": "2022-08-05(星期五)",
      }, {"value": "2791682", "name": "2022-08-06(星期六)"}, {
        "value": "11440",
        "name": "2022-08-07(星期日)",
      }, {"value": "11440", "name": "2022-08-08(星期一)"}, {
        "value": "11440",
        "name": "2022-08-09(星期二)",
      }, {"value": "11440", "name": "2022-08-10(星期三)"}, {
        "value": "11440",
        "name": "2022-08-11(星期四)",
      }, {"value": "11440", "name": "2022-08-12(星期五)"}, {
        "value": "11440",
        "name": "2022-08-13(星期六)",
      }, {"value": "38927387", "name": "2022-08-14(星期日)"}, {
        "value": "38927387",
        "name": "2022-08-15(星期一)",
      }, {"value": "38927387", "name": "2022-08-16(星期二)"}, {
        "value": "38927387",
        "name": "2022-08-17(星期三)",
      }, {"value": "14988767", "name": "2022-08-18(星期四)"}, {
        "value": "12086641",
        "name": "2022-08-19(星期五)",
      }, {"value": "11340001", "name": "2022-08-20(星期六)"}, {
        "value": "14376279",
        "name": "2022-08-21(星期日)",
      }, {"value": "16077249", "name": "2022-08-22(星期一)"}, {
        "value": "14041884",
        "name": "2022-08-23(星期二)",
      }, {"value": "13815649", "name": "2022-08-24(星期三)"}, {
        "value": "17434283",
        "name": "2022-08-25(星期四)",
      }, {"value": "17660518", "name": "2022-08-26(星期五)"}, {
        "value": "13288018",
        "name": "2022-08-27(星期六)",
      }, {"value": "19017178", "name": "2022-08-28(星期日)"}, {
        "value": "17059220",
        "name": "2022-08-29(星期一)",
      }, {"value": "14830153", "name": "2022-08-30(星期二)"}, {
        "value": "16346113", "name": "2022-08-31(星期三)",
      },
    ],
  },
  {
    "name": "加车",
    "data": [
      {"value": null, "name": "2022-07-01(星期五)"}, {
        "value": null,
        "name": "2022-07-02(星期六)",
      }, {"value": null, "name": "2022-07-03(星期日)"}, {"value": null, "name": "2022-07-04(星期一)"}, {
        "value": null,
        "name": "2022-07-05(星期二)",
      }, {"value": null, "name": "2022-07-06(星期三)"}, {"value": null, "name": "2022-07-07(星期四)"}, {
        "value": null,
        "name": "2022-07-08(星期五)",
      }, {"value": null, "name": "2022-07-09(星期六)"}, {"value": null, "name": "2022-07-10(星期日)"}, {
        "value": null,
        "name": "2022-07-11(星期一)",
      }, {"value": null, "name": "2022-07-12(星期二)"}, {"value": null, "name": "2022-07-13(星期三)"}, {
        "value": null,
        "name": "2022-07-14(星期四)",
      }, {"value": null, "name": "2022-07-15(星期五)"}, {"value": null, "name": "2022-07-16(星期六)"}, {
        "value": null,
        "name": "2022-07-17(星期日)",
      }, {"value": null, "name": "2022-07-18(星期一)"}, {"value": null, "name": "2022-07-19(星期二)"}, {
        "value": null,
        "name": "2022-07-20(星期三)",
      }, {"value": null, "name": "2022-07-21(星期四)"}, {"value": null, "name": "2022-07-22(星期五)"}, {
        "value": null,
        "name": "2022-07-23(星期六)",
      }, {"value": null, "name": "2022-07-24(星期日)"}, {"value": null, "name": "2022-07-25(星期一)"}, {
        "value": null,
        "name": "2022-07-26(星期二)",
      }, {"value": null, "name": "2022-07-27(星期三)"}, {"value": null, "name": "2022-07-28(星期四)"}, {
        "value": null,
        "name": "2022-07-29(星期五)",
      }, {"value": null, "name": "2022-07-30(星期六)"}, {"value": null, "name": "2022-07-31(星期日)"}, {
        "value": null,
        "name": "2022-08-01(星期一)",
      }, {"value": null, "name": "2022-08-02(星期二)"}, {"value": null, "name": "2022-08-03(星期三)"}, {
        "value": null,
        "name": "2022-08-04(星期四)",
      }, {"value": null, "name": "2022-08-05(星期五)"}, {"value": null, "name": "2022-08-06(星期六)"}, {
        "value": null,
        "name": "2022-08-07(星期日)",
      }, {"value": null, "name": "2022-08-08(星期一)"}, {"value": null, "name": "2022-08-09(星期二)"}, {
        "value": null,
        "name": "2022-08-10(星期三)",
      }, {"value": null, "name": "2022-08-11(星期四)"}, {"value": null, "name": "2022-08-12(星期五)"}, {
        "value": null,
        "name": "2022-08-13(星期六)",
      }, {"value": null, "name": "2022-08-14(星期日)"}, {"value": null, "name": "2022-08-15(星期一)"}, {
        "value": null,
        "name": "2022-08-16(星期二)",
      }, {"value": null, "name": "2022-08-17(星期三)"}, {"value": null, "name": "2022-08-18(星期四)"}, {
        "value": null,
        "name": "2022-08-19(星期五)",
      }, {"value": null, "name": "2022-08-20(星期六)"}, {"value": null, "name": "2022-08-21(星期日)"}, {
        "value": null,
        "name": "2022-08-22(星期一)",
      }, {"value": null, "name": "2022-08-23(星期二)"}, {"value": null, "name": "2022-08-24(星期三)"}, {
        "value": null,
        "name": "2022-08-25(星期四)",
      }, {"value": null, "name": "2022-08-26(星期五)"}, {"value": null, "name": "2022-08-27(星期六)"}, {
        "value": null,
        "name": "2022-08-28(星期日)",
      }, {"value": null, "name": "2022-08-29(星期一)"}, {"value": null, "name": "2022-08-30(星期二)"}, {
        "value": null,
        "name": "2022-08-31(星期三)",
      },
    ],
  },
  {
    "name": "FB模型",
    "data": [
      {"value": "1111111", "name": "2022-07-01(星期五)"}, {
        "value": "1111111",
        "name": "2022-07-02(星期六)",
      }, {"value": "1111111", "name": "2022-07-03(星期日)"}, {
        "value": "1111111",
        "name": "2022-07-04(星期一)",
      }, {"value": "1111111", "name": "2022-07-05(星期二)"}, {
        "value": "1111111",
        "name": "2022-07-06(星期三)",
      }, {"value": "1111111", "name": "2022-07-07(星期四)"}, {
        "value": "1111111",
        "name": "2022-07-08(星期五)",
      }, {"value": "1111111", "name": "2022-07-09(星期六)"}, {
        "value": "1111111",
        "name": "2022-07-10(星期日)",
      }, {"value": "1111111", "name": "2022-07-11(星期一)"}, {
        "value": "1111111",
        "name": "2022-07-12(星期二)",
      }, {"value": "1111111", "name": "2022-07-13(星期三)"}, {
        "value": "1111111",
        "name": "2022-07-14(星期四)",
      }, {"value": "1111111", "name": "2022-07-15(星期五)"}, {
        "value": "1111111",
        "name": "2022-07-16(星期六)",
      }, {"value": "1111111", "name": "2022-07-17(星期日)"}, {
        "value": "1111111",
        "name": "2022-07-18(星期一)",
      }, {"value": "1111111", "name": "2022-07-19(星期二)"}, {
        "value": "1111111",
        "name": "2022-07-20(星期三)",
      }, {"value": "1111111", "name": "2022-07-21(星期四)"}, {
        "value": "1111111",
        "name": "2022-07-22(星期五)",
      }, {"value": "1111111", "name": "2022-07-23(星期六)"}, {
        "value": "1111111",
        "name": "2022-07-24(星期日)",
      }, {"value": "1111111", "name": "2022-07-25(星期一)"}, {
        "value": "1111111",
        "name": "2022-07-26(星期二)",
      }, {"value": "1111111", "name": "2022-07-27(星期三)"}, {
        "value": "1111111",
        "name": "2022-07-28(星期四)",
      }, {"value": "1111111", "name": "2022-07-29(星期五)"}, {
        "value": "1111111",
        "name": "2022-07-30(星期六)",
      }, {"value": "1111111", "name": "2022-07-31(星期日)"}, {
        "value": "1111111",
        "name": "2022-08-01(星期一)",
      }, {"value": "1111111", "name": "2022-08-02(星期二)"}, {
        "value": "1111111",
        "name": "2022-08-03(星期三)",
      }, {"value": "1111111", "name": "2022-08-04(星期四)"}, {
        "value": "1111111",
        "name": "2022-08-05(星期五)",
      }, {"value": "1111111", "name": "2022-08-06(星期六)"}, {
        "value": "1111111",
        "name": "2022-08-07(星期日)",
      }, {"value": "1111111", "name": "2022-08-08(星期一)"}, {
        "value": "1111111",
        "name": "2022-08-09(星期二)",
      }, {"value": "1111112", "name": "2022-08-10(星期三)"}, {
        "value": "1111113",
        "name": "2022-08-11(星期四)",
      }, {"value": "1111114", "name": "2022-08-12(星期五)"}, {
        "value": "1111115",
        "name": "2022-08-13(星期六)",
      }, {"value": "1111111", "name": "2022-08-14(星期日)"}, {
        "value": "1111111",
        "name": "2022-08-15(星期一)",
      }, {"value": "1111111", "name": "2022-08-16(星期二)"}, {
        "value": "1111111",
        "name": "2022-08-17(星期三)",
      }, {"value": "1111111", "name": "2022-08-18(星期四)"}, {
        "value": "1111111",
        "name": "2022-08-19(星期五)",
      }, {"value": "1111111", "name": "2022-08-20(星期六)"}, {
        "value": "1111111",
        "name": "2022-08-21(星期日)",
      }, {"value": "1111111", "name": "2022-08-22(星期一)"}, {
        "value": "1111111",
        "name": "2022-08-23(星期二)",
      }, {"value": "1111111", "name": "2022-08-24(星期三)"}, {
        "value": "1111111",
        "name": "2022-08-25(星期四)",
      }, {"value": "1111111", "name": "2022-08-26(星期五)"}, {
        "value": "1111111",
        "name": "2022-08-27(星期六)",
      }, {"value": "1111111", "name": "2022-08-28(星期日)"}, {
        "value": "1111111",
        "name": "2022-08-29(星期一)",
      }, {"value": "1111111", "name": "2022-08-30(星期二)"}, {
        "value": "1111111", "name": "2022-08-31(星期三)"
      },
    ],
  },
  {
    "name": "今年",
    "data": [
      {"value": "11440", "name": "2022-07-01(星期五)"}, {
        "value": "11440",
        "name": "2022-07-02(星期六)",
      }, {"value": "11440", "name": "2022-07-03(星期日)"}, {
        "value": "11330",
        "name": "2022-07-04(星期一)",
      }, {"value": "2791683", "name": "2022-07-05(星期二)"}, {
        "value": "2791683",
        "name": "2022-07-06(星期三)",
      }, {"value": "11440", "name": "2022-07-07(星期四)"}, {
        "value": "11440",
        "name": "2022-07-08(星期五)",
      }, {"value": "11440", "name": "2022-07-09(星期六)"}, {
        "value": "11440",
        "name": "2022-07-10(星期日)",
      }, {"value": "11440", "name": "2022-07-11(星期一)"}, {
        "value": "11440",
        "name": "2022-07-12(星期二)",
      }, {"value": "11440", "name": "2022-07-13(星期三)"}, {
        "value": "38927387",
        "name": "2022-07-14(星期四)",
      }, {"value": "32727399", "name": "2022-07-15(星期五)"}, {
        "value": "13237892",
        "name": "2022-07-16(星期六)",
      }, {"value": "32324111", "name": "2022-07-17(星期日)"}, {
        "value": "37287123",
        "name": "2022-07-18(星期一)",
      }, {"value": "1143340", "name": "2022-07-19(星期二)"}, {
        "value": "1143340",
        "name": "2022-07-20(星期三)",
      }, {"value": "29382333", "name": "2022-07-21(星期四)"}, {
        "value": "29382333",
        "name": "2022-07-22(星期五)",
      }, {"value": "29382333", "name": "2022-07-23(星期六)"}, {
        "value": "29382333",
        "name": "2022-07-24(星期日)",
      }, {"value": "20932748", "name": "2022-07-25(星期一)"}, {
        "value": "29382333",
        "name": "2022-07-26(星期二)",
      }, {"value": "29382333", "name": "2022-07-27(星期三)"}, {
        "value": "32032478",
        "name": "2022-07-28(星期四)",
      }, {"value": "42237738", "name": "2022-07-29(星期五)"}, {
        "value": "11273873",
        "name": "2022-07-30(星期六)",
      }, {"value": "20392877", "name": "2022-07-31(星期日)"}, {
        "value": "11440",
        "name": "2022-08-01(星期一)",
      }, {"value": "11440", "name": "2022-08-02(星期二)"}, {
        "value": "11440",
        "name": "2022-08-03(星期三)",
      }, {"value": "11330", "name": "2022-08-04(星期四)"}, {
        "value": "2791683",
        "name": "2022-08-05(星期五)",
      }, {"value": "2791683", "name": "2022-08-06(星期六)"}, {
        "value": "11440",
        "name": "2022-08-07(星期日)",
      }, {"value": "11440", "name": "2022-08-08(星期一)"}, {
        "value": "11440",
        "name": "2022-08-09(星期二)",
      }, {"value": "11440", "name": "2022-08-10(星期三)"}, {
        "value": "11440",
        "name": "2022-08-11(星期四)",
      }, {"value": "11440", "name": "2022-08-12(星期五)"}, {
        "value": "11440",
        "name": "2022-08-13(星期六)",
      }, {"value": "38927387", "name": "2022-08-14(星期日)"}, {
        "value": "38927387",
        "name": "2022-08-15(星期一)",
      }, {"value": "38927387", "name": "2022-08-16(星期二)"}, {
        "value": "38927387",
        "name": "2022-08-17(星期三)",
      }, {"value": "14988767", "name": "2022-08-18(星期四)"}, {
        "value": "12086641",
        "name": "2022-08-19(星期五)",
      }, {"value": "11340001", "name": "2022-08-20(星期六)"}, {
        "value": "14376279",
        "name": "2022-08-21(星期日)",
      }, {"value": "14376279", "name": "2022-08-22(星期一)"}, {
        "value": null,
        "name": "2022-08-23(星期二)",
      }, {"value": null, "name": "2022-08-24(星期三)"}, {"value": null, "name": "2022-08-25(星期四)"}, {
        "value": null,
        "name": "2022-08-26(星期五)",
      }, {"value": null, "name": "2022-08-27(星期六)"}, {"value": null, "name": "2022-08-28(星期日)"}, {
        "value": null,
        "name": "2022-08-29(星期一)",
      }, {"value": null, "name": "2022-08-30(星期二)"}, {"value": null, "name": "2022-08-31(星期三)"},
    ],
  },
  {
    "name": "去年",
    "data": [
      {"value": "3333333", "name": "2021-07-02(星期五)"}, {
        "value": "3333333",
        "name": "2021-07-03(星期六)",
      }, {"value": "3333333", "name": "2021-07-04(星期日)"}, {
        "value": "3333333",
        "name": "2021-07-05(星期一)",
      }, {"value": "3333333", "name": "2021-07-06(星期二)"}, {
        "value": "3333333",
        "name": "2021-07-07(星期三)",
      }, {"value": "3333333", "name": "2021-07-08(星期四)"}, {
        "value": "3333333",
        "name": "2021-07-09(星期五)",
      }, {"value": "3333333", "name": "2021-07-10(星期六)"}, {
        "value": "3333333",
        "name": "2021-07-11(星期日)",
      }, {"value": "3333333", "name": "2021-07-12(星期一)"}, {
        "value": "3333333",
        "name": "2021-07-13(星期二)",
      }, {"value": "3333333", "name": "2021-07-14(星期三)"}, {
        "value": "3333333",
        "name": "2021-07-15(星期四)",
      }, {"value": "3333333", "name": "2021-07-16(星期五)"}, {
        "value": "3333333",
        "name": "2021-07-17(星期六)",
      }, {"value": "3333333", "name": "2021-07-18(星期日)"}, {
        "value": "3333333",
        "name": "2021-07-19(星期一)",
      }, {"value": "3333333", "name": "2021-07-20(星期二)"}, {
        "value": "3333333",
        "name": "2021-07-21(星期三)",
      }, {"value": "3333333", "name": "2021-07-22(星期四)"}, {
        "value": "3333333",
        "name": "2021-07-23(星期五)",
      }, {"value": "3333333", "name": "2021-07-24(星期六)"}, {
        "value": "3333333",
        "name": "2021-07-25(星期日)",
      }, {"value": "3333333", "name": "2021-07-26(星期一)"}, {
        "value": "3333333",
        "name": "2021-07-27(星期二)",
      }, {"value": "3333333", "name": "2021-07-28(星期三)"}, {
        "value": "3333333",
        "name": "2021-07-29(星期四)",
      }, {"value": "3333333", "name": "2021-07-30(星期五)"}, {
        "value": "3333333",
        "name": "2021-07-31(星期六)",
      }, {"value": "3333333", "name": "2021-08-01(星期日)"}, {
        "value": "3333333",
        "name": "2021-08-02(星期一)",
      }, {"value": "3333333", "name": "2021-08-03(星期二)"}, {
        "value": "3333333",
        "name": "2021-08-04(星期三)",
      }, {"value": "3334299", "name": "2021-08-05(星期四)"}, {
        "value": "2519621",
        "name": "2021-08-06(星期五)",
      }, {"value": "2551661", "name": "2021-08-07(星期六)"}, {
        "value": "2551661",
        "name": "2021-08-08(星期日)",
      }, {"value": "2551661", "name": "2021-08-09(星期一)"}, {
        "value": "2551661",
        "name": "2021-08-10(星期二)",
      }, {"value": "2551661", "name": "2021-08-11(星期三)"}, {
        "value": "2551661",
        "name": "2021-08-12(星期四)",
      }, {"value": "2551661", "name": "2021-08-13(星期五)"}, {
        "value": "2551661",
        "name": "2021-08-14(星期六)",
      }, {"value": "2551661", "name": "2021-08-15(星期日)"}, {
        "value": "2551661",
        "name": "2021-08-16(星期一)",
      }, {"value": "2551661", "name": "2021-08-17(星期二)"}, {
        "value": "2551661",
        "name": "2021-08-18(星期三)",
      }, {"value": "2551661", "name": "2021-08-19(星期四)"}, {
        "value": "2551661",
        "name": "2021-08-20(星期五)",
      }, {"value": "2551661", "name": "2021-08-21(星期六)"}, {
        "value": "2551661",
        "name": "2021-08-22(星期日)",
      }, {"value": "2551661", "name": "2021-08-23(星期一)"}, {
        "value": "2551661",
        "name": "2021-08-24(星期二)",
      }, {"value": "2551661", "name": "2021-08-25(星期三)"}, {
        "value": "2551661",
        "name": "2021-08-26(星期四)",
      }, {"value": "2551661", "name": "2021-08-27(星期五)"}, {
        "value": "2551661",
        "name": "2021-08-28(星期六)",
      }, {"value": "2551661", "name": "2021-08-29(星期日)"}, {
        "value": "2551661",
        "name": "2021-08-30(星期一)",
      }, {"value": "2551661", "name": "2021-08-31(星期二)"}, {
        "value": "3334299", "name": "2021-09-01(星期三)",
      },
    ],
  },
  {
    "name": "前年",
    "data": [
      {"value": "8953096", "name": "2020-07-03(星期五)"}, {
        "value": "8270698",
        "name": "2020-07-04(星期六)",
      }, {"value": "6720362", "name": "2020-07-05(星期日)"}, {
        "value": "9926303",
        "name": "2020-07-06(星期一)",
      }, {"value": "9599827", "name": "2020-07-07(星期二)"}, {
        "value": "10115924",
        "name": "2020-07-08(星期三)",
      }, {"value": "10641007", "name": "2020-07-09(星期四)"}, {
        "value": "9661682",
        "name": "2020-07-10(星期五)",
      }, {"value": "9044122", "name": "2020-07-11(星期六)"}, {
        "value": "8008287",
        "name": "2020-07-12(星期日)",
      }, {"value": "9768689", "name": "2020-07-13(星期一)"}, {
        "value": "8532898",
        "name": "2020-07-14(星期二)",
      }, {"value": "8777807", "name": "2020-07-15(星期三)"}, {
        "value": "9751142",
        "name": "2020-07-16(星期四)",
      }, {"value": "9635636", "name": "2020-07-17(星期五)"}, {
        "value": "8445398",
        "name": "2020-07-18(星期六)",
      }, {"value": "8042058", "name": "2020-07-19(星期日)"}, {
        "value": "10832879",
        "name": "2020-07-20(星期一)",
      }, {"value": "10010240", "name": "2020-07-21(星期二)"}, {
        "value": "9246450",
        "name": "2020-07-22(星期三)",
      }, {"value": "9243523", "name": "2020-07-23(星期四)"}, {
        "value": "8883455",
        "name": "2020-07-24(星期五)",
      }, {"value": "8102983", "name": "2020-07-25(星期六)"}, {
        "value": "7414057",
        "name": "2020-07-26(星期日)",
      }, {"value": "9705442", "name": "2020-07-27(星期一)"}, {
        "value": "8505966",
        "name": "2020-07-28(星期二)",
      }, {"value": "8523888", "name": "2020-07-29(星期三)"}, {
        "value": "8575895",
        "name": "2020-07-30(星期四)",
      }, {"value": "8479901", "name": "2020-07-31(星期五)"}, {
        "value": "7904002",
        "name": "2020-08-01(星期六)",
      }, {"value": "7313982", "name": "2020-08-02(星期日)"}, {
        "value": "10096053",
        "name": "2020-08-03(星期一)",
      }, {"value": "8259426", "name": "2020-08-04(星期二)"}, {
        "value": "8079436",
        "name": "2020-08-05(星期三)",
      }, {"value": "8455695", "name": "2020-08-06(星期四)"}, {
        "value": "7963693",
        "name": "2020-08-07(星期五)",
      }, {"value": "7590252", "name": "2020-08-08(星期六)"}, {
        "value": "6963672",
        "name": "2020-08-09(星期日)",
      }, {"value": "9463615", "name": "2020-08-10(星期一)"}, {
        "value": "7779965",
        "name": "2020-08-11(星期二)",
      }, {"value": "7586094", "name": "2020-08-12(星期三)"}, {
        "value": "7832598",
        "name": "2020-08-13(星期四)",
      }, {"value": "7582902", "name": "2020-08-14(星期五)"}, {
        "value": "7096530",
        "name": "2020-08-15(星期六)",
      }, {"value": "6760823", "name": "2020-08-16(星期日)"}, {
        "value": "9438174",
        "name": "2020-08-17(星期一)",
      }, {"value": "7948111", "name": "2020-08-18(星期二)"}, {
        "value": "7188889",
        "name": "2020-08-19(星期三)",
      }, {"value": "7503041", "name": "2020-08-20(星期四)"}, {
        "value": "7449431",
        "name": "2020-08-21(星期五)",
      }, {"value": "7005110", "name": "2020-08-22(星期六)"}, {
        "value": "6814415",
        "name": "2020-08-23(星期日)",
      }, {"value": "8666614", "name": "2020-08-24(星期一)"}, {
        "value": "7230938",
        "name": "2020-08-25(星期二)",
      }, {"value": "6934086", "name": "2020-08-26(星期三)"}, {
        "value": "7265622",
        "name": "2020-08-27(星期四)",
      }, {"value": "7229951", "name": "2020-08-28(星期五)"}, {
        "value": "6705025",
        "name": "2020-08-29(星期六)",
      }, {"value": "6555768", "name": "2020-08-30(星期日)"}, {
        "value": "8681007",
        "name": "2020-08-31(星期一)",
      }, {"value": "7339373", "name": "2020-09-01(星期二)"}, {
        "value": "7132812", "name": "2020-09-02(星期三)",
      },
    ],
  },
  {
    "name": "大前年",
    "data": [
      {"value": "1818886", "name": "2019-07-05(星期五)"}, {
        "value": "1579402",
        "name": "2019-07-06(星期六)",
      }, {"value": "1469936", "name": "2019-07-07(星期日)"}, {
        "value": "1983537",
        "name": "2019-07-08(星期一)",
      }, {"value": "1778539", "name": "2019-07-09(星期二)"}, {
        "value": "1713667",
        "name": "2019-07-10(星期三)",
      }, {"value": "1745000", "name": "2019-07-11(星期四)"}, {
        "value": "1772424",
        "name": "2019-07-12(星期五)",
      }, {"value": "1633339", "name": "2019-07-13(星期六)"}, {
        "value": "1448111",
        "name": "2019-07-14(星期日)",
      }, {"value": "2000602", "name": "2019-07-15(星期一)"}, {
        "value": "1802662",
        "name": "2019-07-16(星期二)",
      }, {"value": "1714428", "name": "2019-07-17(星期三)"}, {
        "value": "1768551",
        "name": "2019-07-18(星期四)",
      }, {"value": "1756150", "name": "2019-07-19(星期五)"}, {
        "value": "1624079",
        "name": "2019-07-20(星期六)",
      }, {"value": "1434331", "name": "2019-07-21(星期日)"}, {
        "value": "2103453",
        "name": "2019-07-22(星期一)",
      }, {"value": "1700703", "name": "2019-07-23(星期二)"}, {
        "value": "1685405",
        "name": "2019-07-24(星期三)",
      }, {"value": "1736797", "name": "2019-07-25(星期四)"}, {
        "value": "1737070",
        "name": "2019-07-26(星期五)",
      }, {"value": "1543749", "name": "2019-07-27(星期六)"}, {
        "value": "1382448",
        "name": "2019-07-28(星期日)",
      }, {"value": "1972452", "name": "2019-07-29(星期一)"}, {
        "value": "1685829",
        "name": "2019-07-30(星期二)",
      }, {"value": "1618509", "name": "2019-07-31(星期三)"}, {
        "value": "1769273",
        "name": "2019-08-01(星期四)",
      }, {"value": "1715205", "name": "2019-08-02(星期五)"}, {
        "value": "1634666",
        "name": "2019-08-03(星期六)",
      }, {"value": "1456242", "name": "2019-08-04(星期日)"}, {
        "value": "2007086",
        "name": "2019-08-05(星期一)",
      }, {"value": "1739611", "name": "2019-08-06(星期二)"}, {
        "value": "1691057",
        "name": "2019-08-07(星期三)",
      }, {"value": "1739733", "name": "2019-08-08(星期四)"}, {
        "value": "1693849",
        "name": "2019-08-09(星期五)",
      }, {"value": "1568188", "name": "2019-08-10(星期六)"}, {
        "value": "1373375",
        "name": "2019-08-11(星期日)",
      }, {"value": "1950351", "name": "2019-08-12(星期一)"}, {
        "value": "1726089",
        "name": "2019-08-13(星期二)",
      }, {"value": "1579338", "name": "2019-08-14(星期三)"}, {
        "value": "1547640",
        "name": "2019-08-15(星期四)",
      }, {"value": "1723723", "name": "2019-08-16(星期五)"}, {
        "value": "1540390",
        "name": "2019-08-17(星期六)",
      }, {"value": "1450190", "name": "2019-08-18(星期日)"}, {
        "value": "1995599",
        "name": "2019-08-19(星期一)",
      }, {"value": "1681402", "name": "2019-08-20(星期二)"}, {
        "value": "1600466",
        "name": "2019-08-21(星期三)",
      }, {"value": "1676259", "name": "2019-08-22(星期四)"}, {
        "value": "1639434",
        "name": "2019-08-23(星期五)",
      }, {"value": "1471690", "name": "2019-08-24(星期六)"}, {
        "value": "1354168",
        "name": "2019-08-25(星期日)",
      }, {"value": "1876780", "name": "2019-08-26(星期一)"}, {
        "value": "1498853",
        "name": "2019-08-27(星期二)",
      }, {"value": "1440765", "name": "2019-08-28(星期三)"}, {
        "value": "1528876",
        "name": "2019-08-29(星期四)",
      }, {"value": "1434090", "name": "2019-08-30(星期五)"}, {
        "value": "1411088",
        "name": "2019-08-31(星期六)",
      }, {"value": "1433277", "name": "2019-09-01(星期日)"}, {
        "value": "1841316",
        "name": "2019-09-02(星期一)",
      }, {"value": "2010707", "name": "2019-09-03(星期二)"}, {
        "value": "1436161", "name": "2019-09-04(星期三)",
      },
    ],
  },
];
